{
    "name": "Ara Sheperdigian",
    "contact": {
      "phone": "(248) 238-8615",
      "email": "ara.benjamin@gmail.com",
      "github": "https://github.com/arabenjamin",
      "linkedin": "https://www.linkedin.com/in/ara-sheperdigian-a751a418"
    },
    "objective": "Energetic, innovative and competent business professional offering a rich mixture of experience and success in a variety of work environments. I am looking to put my work experience and my passion for programming and technology to good use to help ensure success for the company or institution that I’ll be a part of.",
    "experience": [
      {
        "company": "HP",
        "location": "Boise, ID (Remote via Experis)",
        "title": "Software Engineer",
        "dates": "May 2021 - February 2023",
        "responsibilities": [
          "Worked as a software engineer in R&D on the Color & Imaging team to help build a cloud diagnostic system to review physical prints from a physical printer to determine the health of the physical components of the printer.",
          "Built a tiny-URL micro service in Python using Django to shorten diagnostic api endpoints, to be rendered on low res screen on a printer as a QR code.",
          "Built in Python mock services to enable others to write code for parts where integration could not be implemented.",
          "Mocked physical printer apis that had yet to be implemented on the printer.",
          "Mocked server side cloud endpoints for unit testing.",
          "Updated printer simulator in C++ to handle api endpoints on the printer, including unit tests.",
          "Wrote standalone scripts for manual testers."
        ]
      },
      {
        "company": "Humana Insurance",
        "location": "Louisville, KY (Remote, via Cognizant, via E-Solutions)",
        "title": "Software Engineer",
        "dates": "July 2020 - January 2021 (6 month Contract)",
        "responsibilities": [
          "Worked as a devops engineer to support an internal service called Onramp, that helps to automate and maintain technical resources, and resource groups for the business.",
          "Developed, tested and deployed api endpoints to extend features to address business evolving business needs for automating resource group creation in Azure Active Directory.",
          "Used Docker to build dev, test and prod images to be deployed in Kubernetes.",
          "Used Python3 and Bottle to build, test, and deploy REST API endpoints for new features in the Onramp Platform."
        ]
      },
      {
        "company": "ElTec Systems, LLC",
        "location": "Seattle, WA",
        "title": "Senior IT Professional",
        "dates": "Oct 2015 - June 2020",
        "responsibilities": [
          "Moving to Eltec Systems gave me the opportunity to move away from account management and exercise my passion for technology. I was originally hired for a temporary data entry position. I was given a project to manually find all the elevators that needed service, potential sales opportunities for the company. I impressed the owner with creating a script that quickly sorted the information into a spreadsheet in seconds. This led to me being hired full time where I manage the IT networks, build internal and external facing web applications that help streamline the business, and data mining and reporting on service performance.",
          "Created and developed in Golang a web base using AWS route planner our dispatch coordinator and service management use to see all the routes of the technicians, instead of manually plotting out the routes of each technician.",
          "Created and developed in Golang a web app using AWS that maintains a database of all inventory items that need to be picked up and delivered. Allows communication between the supplier and driver on when the parts have been delivered and records them into the database.",
          "Created and developed in Golang a client facing app using AWS that allows our clients to place service requests for their buildings. And automatically sends the service request to the correct service mechanic.",
          "Build, test and deploy and backend RESTFUL api to handle user authentication with golang.",
          "Validate username and password fields with golang.",
          "Lookup user in database, validate password with golang.",
          "Returned a jwt token."
        ]
      },
      {
        "company": "HCL America",
        "location": "Redmond, WA",
        "title": "Fulfillment Manager",
        "dates": "Oct 2013 – Sept 2015",
        "responsibilities": [
          "Being passionate about technology I decided my next step was to move to Seattle. Upon arrival, I started contracting for HCL where it was my role to maintain a pool of 600+ software testers that would be used by our clients based on daily needs. I created an optimized process that allowed us to efficiently schedule the software testers for the following day based on demands and ability to communicate to the software testers for quick turnaround.",
          "Define project deliverables, timeline, and resources required for related projects.",
          "Compiled project status reports and resolve any conflicts that would arise."
        ]
      },
      {
        "company": "Law Office of Joseph P. Saulski",
        "location": "Waterford, MI",
        "title": "IT Admin/Paralegal",
        "dates": "Feb 2012 – Aug 2013",
        "responsibilities": [
          "Due to shortage of funding from the startup, a mutual colleague approached me to manage the IT solutions in his office. Being a new small law office I would double as a paralegal when needed.",
          "Developed a web app to document and store new client information into a database instead of storing it in physical files."
        ]
      },
      {
        "company": "RCS Technology of Michigan LLC",
        "location": "Waterford, MI",
        "title": "Account Manager",
        "dates": "Apr 2011 – Jan 2012",
        "responsibilities": [
          "After several years of installing networks and phone lines, I wanted to be more in the front line of IT solutions. I joined a start-up that offered managed IT solutions for small to medium sized businesses. In my short time there, I was able to reduce overhead cost and bring in a new revenue stream to the company.",
          "Tapping into my previous experience I was able offer my clients cable and networking solutions for new clients that did not have any infrastructure setup.",
          "Negotiated a deal between a client and the company where in exchange for services the client offered us office space thus reducing our overhead by 35%."
        ]
      },
      {
        "company": "Fastcomm Inc",
        "location": "Waterford, MI",
        "title": "Telecommunication Technician",
        "dates": "Jan 2007 – Apr 2011",
        "responsibilities": [
          "Working as a technician here is when I got my feet wet in the technology sector. In my role, I would service and install entire physical networks and phone lines for commercial industries."
        ]
      }
    ],
    "skills": {
      "languages": [
        "Python (10 years)",
        "Golang (6 years)",
        "Javascript/Typescript (6 years)",
        "C/C++",
        "Rust"
      ],
      "security": [
        "SSL",
        "Encryption"
      ],
      "web_servers": [
        "Nginx",
        "Apache"
      ],
      "web_frameworks": [
        "Node",
        "React",
        "Vue",
        "Django",
        "Flask",
        "FastAPI"
      ],
      "databases": [
        "DuckDB",
        "MySQL/MariaDB",
        "SQLite3",
        "PostgreSQL",
        "MongoDB",
        "Redis"
      ],
      "os_platform": [
        "Linux",
        "Windows",
        "IoT",
        "Embedded Systems"
      ],
      "vm_containers_cloud": [
        "Docker",
        "Docker Compose",
        "Kubernetes",
        "VirtualBox",
        "VMware",
        "AWS",
        "Google Cloud",
        "Azure"
      ],
      "robotics": [
        "Microcontrollers",
        "Atmega328p",
        "ESP8266",
        "I2C, SPI, UART",
        "Troubleshooting microcontrollers and their corresponding circuits"
      ],
      "robotics_projects": [
        "Connected a Wii chuck to a robotic arm",
        "Built restful service to run on raspberry pi to remotely communicate with small rover",
        "Used an accelerometer to keep robotic arm level",
        "Setup OpenCV on Raspberry Pi, used webcam and ML to find humans, mapped visual coordinates to pan/tilt servos to keep humans in the center of the screen."
      ]
    }
  }